package by.it.papruha.lesson02;

/*
Выводим квадрат числа
Напишите программу, которая считывает с клавиатуры целое число a и выводит квадрат этого числа (a * a).
Для считывания данных с клавиатуры используйте метод nextInt() объекта класса Scanner.

Создать Scanner можно так:
Scanner sc=new Scanner(System.in);

Требования:
1. Программа должна выводить текст.
2. В программе необходимо создать объект типа Scanner.
3. Программа должна считывать число типа Int с клавиатуры.
4. Программа должна выводить квадрат считанного числа.

 */

import java.util.Scanner;

class TaskB1 {
    public static void main(String[] args) {
        System.out.print("Введите целое число от 0 до 10, которое хотите возвести в квадрат: ");
        Scanner sc = new Scanner(System.in);
        int num = sc.nextInt();
        int k = num*num;
        System.out.println(num+" в квадрате"+" = "+k);
    }
}
