package by.it.verishko.lesson02;

class TaskA1 {
/*
напишите программу которая выводит на экран


(строка должа быть одна, ошибки в тексте не допускаются)
Для ручной проверки запустите программу Ctrl+Shift+F10
Для автоматической проверки откройте и запустите класс Testing
*/
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}
